[
    {
        "word": "how are you",
        "language": "thai",
        "translation_raw": "---START_TRANSLATION_OUTPUT---\n**FORMAL:**\nสบายดีหรือ (sabai dee rue) - How are you? (Are you well?)\n\n**INFORMAL:**\nเป็นอย่างไรบ้าง (pen yang rai bang) - How are you? (How's it going?)\n\n**SLANG_CONVERSATION_USE:**\n- เป็นไงบ้าง (pen ngai bang) - Shorter, more casual version of \"เป็นอย่างไรบ้าง\" (pen yang rai bang). Used frequently between friends.\n- หวัดดี (wat dee) - Literally \"hello,\" but can sometimes function as a casual \"how are you\" in passing. Often used when you see someone regularly and don't need a full update.\n\n**EXAMPLE_SENTENCE:**\nวันนี้คุณสบายดีหรือ (wan nee khun sabai dee rue)\nEnglish Translation: How are you today?\n\n**EXPLANATION:**\n\n*   \"สบายดีหรือ\" (sabai dee rue) is the most polite and formal way to ask \"How are you?\" It's appropriate for addressing elders, superiors, or people you don't know well. \"สบาย\" (sabai) means comfortable or well, \"ดี\" (dee) means good, and \"หรือ\" (rue) turns it into a question.\n\n*   \"เป็นอย่างไรบ้าง\" (pen yang rai bang) is a more general and commonly used way to ask \"How are you?\" It is suitable for most situations, including friends, acquaintances, and colleagues. \"เป็น\" (pen) means to be, \"อย่างไร\" (yang rai) means how, and \"บ้าง\" (bang) softens the question.\n\n*   \"เป็นไงบ้าง\" (pen ngai bang) is a very casual abbreviation of \"เป็นอย่างไรบ้าง\" (pen yang rai bang) and is used mainly between close friends or family.\n\n*   It's common to respond to \"สบายดีหรือ\" (sabai dee rue) or \"เป็นอย่างไรบ้าง\" (pen yang rai bang) with \"สบายดี\" (sabai dee) - I'm well, or with details about how you're feeling or what you've been up to.\n---END_TRANSLATION_OUTPUT---"
    }
]